@echo off
chcp 65001 >nul

echo ЗАПУСК TVA-СЕРВЕРА...
echo.
echo ПРЕДУПРЕЖДЕНИЕ: Не закрывайте это окно. Иначе причинно-следственные связи разорвутся.
echo СЕРВЕР РАБОТАЕТ.
echo ДЛЯ ОСТАНОВКИ НАЖМИТЕ Ctrl+C.
echo.
echo ============================================================
echo ДОСТУП К ХРОНИКАМ ИЗМЕРЕНИЙ АКТИВИРОВАН
echo ПОДКЛЮЧЕНИЕ К ВРЕМЕННОЙ ЛИНИИ...
echo ============================================================
echo.

start http://localhost:8000
"C:\Program Files\Python311\python.exe" siss.py

echo.
echo ============================================================
echo СЕРВЕР ОСТАНОВЛЕН. РЕАЛЬНОСТЬ СТАБИЛЬНА.
echo ============================================================
pause
